// Поле игры:
let gameField = $('.error404__game');

// HTML-содержимое обертки игрового элемента:
let gameItemWrapper = '<div class="error404__game-item-wrapper"></div>';

// HTML-содержимое игрового элемента:
let gameItem = '<div class="error404__game-item"></div>';

// Заполнение поля игры обертками игрового элемента:
for (let i = 0; i < 16 * 16; i++) {
   gameField.append(gameItemWrapper);
}

// Добавление игрового элемента внутрь обертки:
$('.error404__game-item-wrapper').append(gameItem);

// Индексы игровых элементов, которые будут закрашены изначально:
let initialPicture = [12, 13, 23, 24, 27, 28, 38, 39, 42, 43, 53, 54, 57, 58, 68, 69, 72, 73, 75, 76, 83, 84, 87, 88, 89, 92, 93, 98, 99, 102, 103, 105, 106, 109, 110, 113, 114, 117, 118, 122, 123, 126, 127, 129, 132, 133, 139, 140, 143, 144, 145, 146, 149, 150, 154, 155, 158, 159, 162, 163, 166, 167, 169, 170, 173, 174, 179, 180, 183, 184, 185, 188, 189, 199, 200, 203, 204, 214, 215, 218, 219, 229, 230, 243, 244];

// Закрашивание вышеупомянутых игровых элементов:
for (let i = 0; i < $('.error404__game-item').length; i++) {
   if (initialPicture.indexOf(i) !== -1) {
      $(`.error404__game-item:eq(${i - 1})`).addClass('game-active-item');
   }
}

// При клике на игровой элемент добавляем/убираем закрашивание:
$('.error404__game-item').click(function() {
   $(this).toggleClass('game-active-item');
 });